# ExternalApplicationArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArray Constructor
ExternalApplicationArray Class See Also
---
Initializes a new instance of the ExternalApplicationArray class
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExternalApplicationArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExternalApplicationArray()
```

# See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace